# Version control
brew "git"

# Shell & Terminal
brew "zsh"                  # Modern shell
brew "zsh-completions"      # Additional completions
brew "starship"             # Beautiful prompt


# File & System Management
brew "tree"                 # Directory tree visualization
brew "htop"                 # Better process viewer
brew "fd"                   # Fast find alternative
brew "ripgrep"              # Fast grep alternative (rg)
brew "bat"                  # Better cat with syntax highlighting
brew "eza"                  # Modern ls replacement (successor to exa)
brew "dust"                 # Better du (disk usage)
brew "duf"                  # Better df (disk free)

# Network & Web
brew "curl"
brew "wget"
brew "httpie"               # User-friendly HTTP client

# Containers (CLI-based, no Docker Desktop)
brew "docker"                 # Docker CLI
brew "docker-compose"         # Compose (v2)
brew "colima"                 # Lightweight Docker runtime on macOS
